test/tests/postprocessors/side_integrated_value/foam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver          postprocessorTestSolver;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.32;

deltaT          0.01;

writeControl    timeStep;

writeInterval   1;

writeFormat     ascii;

writePrecision  20;

writeCompression off;

timeFormat      general;

timePrecision   20;

runTimeModifiable true;

// ************************************************************************* //
